# SQLITE3
* Using my sqlite database to run

#### Import Libraries

In [1]:
import sqlite3
import mysql.connector
import pymongo
import pandas as pd

###### Create a database that will hold the the tables and documents

In [2]:
con = sqlite3.connect('demployees.db')

###### Put the database in a cursor holder

In [3]:
cursor = con.cursor()

###### create a table in the cursor folder

In [4]:
cursor.execute("CREATE TABLE HR(id integer PRIMARY KEY, name text, status text, salary real, department text, position text, hireDate text)")
con.commit()

###### create a counter

In [7]:
counter = True
while counter:
    user_id = int(input('Enter your ID: '))
    name = input('Enter your name: ')
    status = input('Enter your status: ')
    salary = float(input('Enter your salary: '))
    department = input('Enter your department: ')
    position = input('Enter your position: ')
    date = input('Enter date "YYYY-M-D": ')
    entities = (user_id,name,status,salary,department,position,date)
    cursor.execute("INSERT INTO HR(id,name,status,salary,department,position,hireDate) VALUES(?,?,?,?,?,?,?)",entities)
    con.commit()
    print('Data has been inserted!!!')
    print('Do you want to continue?')
    value = int(input("Enter 1 to continue and 0 to quit"))
    if value == 1:
        pass
    elif value == 0:
        print('Thank you!!')
        counter = False
    else:
        break

Enter your ID: 004
Enter your name: KATE
Enter your status: NO
Enter your salary: 3000
Enter your department: HR
Enter your position: IT
Enter date "YYYY-M-D": 2021-07-05
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit1
Enter your ID: 005
Enter your name: MERCY
Enter your status: YES
Enter your salary: 2000
Enter your department: HR
Enter your position: IT
Enter date "YYYY-M-D": 2021-07-03
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit0
Thank you!!

###### fetch all the data in your HR table and print in rows and add row numbers

In [8]:
cursor.execute('SELECT * FROM HR')
rows = cursor.fetchall()

In [16]:
for row in rows:
    print(row)
    print(row[0])

(1, 'Winner E', 'Yes', 500.0, 'HR', 'MG', '2021-07-08')
1
(2, 'MARY A', 'NO', 700.0, 'IT', 'HR', '2021-07-08')
2
(3, 'JOY', 'YES', 1500.0, 'IT', 'IT', '2021-07-09')
3
(4, 'KATE', 'NO', 3000.0, 'HR', 'IT', '2021-07-05')
4
(5, 'MERCY', 'YES', 2000.0, 'HR', 'IT', '2021-07-03')
5

###### put in list, 
* add the list to a dictionary in rows and print dictionary

In [10]:
mylist = []

In [11]:
for row in rows:
    mylist.append({'id':row[0], 'name':row[1], 'status':row[2], 'salary':row[3], 'department':row[4], 'position':row[5], 'data':row[6]})

In [12]:
print(mylist)

[{'id': 1, 'name': 'Winner E', 'status': 'Yes', 'salary': 500.0, 'department': 'HR', 'position': 'MG', 'data': '2021-07-08'}, {'id': 2, 'name': 'MARY A', 'status': 'NO', 'salary': 700.0, 'department': 'IT', 'position': 'HR', 'data': '2021-07-08'}, {'id': 3, 'name': 'JOY', 'status': 'YES', 'salary': 1500.0, 'department': 'IT', 'position': 'IT', 'data': '2021-07-09'}, {'id': 4, 'name': 'KATE', 'status': 'NO', 'salary': 3000.0, 'department': 'HR', 'position': 'IT', 'data': '2021-07-05'}, {'id': 5, 'name': 'MERCY', 'status': 'YES', 'salary': 2000.0, 'department': 'HR', 'position': 'IT', 'data': '2021-07-03'}]

###### put the data list into a dataframe and print

In [13]:
sqlite3_df = pd.DataFrame(mylist)

In [14]:
print(sqlite3_df)

   id      name status  salary department position        data
0   1  Winner E    Yes   500.0         HR       MG  2021-07-08
1   2    MARY A     NO   700.0         IT       HR  2021-07-08
2   3       JOY    YES  1500.0         IT       IT  2021-07-09
3   4      KATE     NO  3000.0         HR       IT  2021-07-05
4   5     MERCY    YES  2000.0         HR       IT  2021-07-03

# MYSQL Data Source

* using xampp to run and Myphp to view

###### link to the sql connector

In [17]:
mydb = mysql.connector.connect(host="localhost",user="root",password="")

###### steps to creating table
* create a database and 
* connect the database to the sql connector 
* create a cursor for the database
* creating a table in the cursor

In [19]:
cursor.execute("CREATE DATABASE demployees")

In [30]:
mydb = mysql.connector.connect(host="localhost",user="root",password="",database="demployees")

In [31]:
cursor = mydb.cursor()

In [32]:
cursor.execute("CREATE TABLE IT (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), status VARCHAR(255), salary INT, department VARCHAR(255), position VARCHAR(255), high_date VARCHAR(255))")
mydb.commit()

###### create a counter

In [34]:
counter = True
while counter:
    name = input('Enter your name: ')
    status = input('Enter your status')
    salary = int(input('Enter your salary: '))
    department = input('Enter your department: ')
    position = input('Enter your position: ')
    date = input('Enter date "YYYY-M-D": ')
    vals = (name,status,salary,department,position,date)
    sql = "INSERT INTO IT(name,status,salary,department,position,high_date) VALUES(%s,%s,%s,%s,%s,%s)"
    cursor.execute(sql,vals)
    mydb.commit()
    print('Data has been inserted!!!')
    print('Do you want to continue?')
    value = int(input("Enter 1 to continue and 0 to quit"))
    if value == 1:
        pass
    elif value == 0:
        print('Thank you!!')
        counter = False
    else:
        break

Enter your name: JOHN E
Enter your statusYES
Enter your salary: 1000
Enter your department: HR
Enter your position: IT
Enter date "YYYY-M-D": 2021-07-03
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit0
Thank you!!

###### fetch all the data in your IT table 
* add list
* add list in dictionary
* print dictionary in DataFrame

In [35]:
cursor.execute("SELECT * FROM IT")
rows = cursor.fetchall()

In [36]:
mylist = []

In [37]:
for row in rows:
    mylist.append({'id':row[0], 'name':row[1], 'status':row[2], 'salary':row[3], 'department':row[4], 'position':row[5], 'data':row[6]})

In [38]:
mysql_df = pd.DataFrame(mylist)
mysql_df

   id      name status  salary department position        data
0   1  Winner E    Yes    5000         IT       MG  2021-07-08
1   2   GRACE I    YES    4500         IT       HR  2021-07-06
2   3  LILIAN U    YES    6000         HR       MG  2021-07-08
3   4    KATE J     NO    3000         HR       IT  2021-07-05
4   5    JOHN E    YES    1000         HR       IT  2021-07-03

# Mongo Data Source
* using Mongo compass to run

###### initialize a mongo connection

In [39]:
myclient = pymongo.MongoClient('mongodb://localhost:27017')

###### steps
* Create a database
* Create a table in the database
* add necessary columns

In [40]:
mydb = myclient['demployees']

In [41]:
mycol = mydb['transactions']

In [42]:
columns = ["id","name","product","amount","saleprice","status","date"]

###### create a counter

In [45]:
counter = True
while counter:
    user_id = input("Id: ")
    name = input("Name: ")
    product= input("Product: ")
    amount = int(input("Amount: "))
    saleprice = float(input("Saleprice: "))
    status = input("Status: ")
    date = input("Date YYYY-M-D: ")

    mydict = {"_id":user_id,"name":name,"product":product,"amount":amount,"saleprice":saleprice,"status":status,"date":date}
    x = mycol.insert_one(mydict)

    print('Data has been inserted!!!')
    print('Do you want to continue?')
    value = int(input("Enter 1 to continue and 0 to quit: "))
    if value == 1:
        pass
    elif value == 0:
        print('Thank you!!')
        counter = False
    else:
        break

Id: 004
Name: KATE
Product: BAG
Amount: 3000
Saleprice: 100000
Status: SOLD
Date YYYY-M-D: 2021-07-01
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit: 1
Id: 005
Name: LILIAN
Product: HAIR
Amount: 1500
Saleprice: 150000
Status: SOLD
Date YYYY-M-D: 2021-07-09
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit: 1
Id: 006
Name: MARY
Product: HYPE
Amount: 20000000
Saleprice: 500000000
Status: SOLD
Date YYYY-M-D: 2021-07-03
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit: 0
Thank you!!

###### same with previous steps in sql but different approach
###### fetch all the data in your Transaction table 
* call all data in a column and run in x or any letter of your choice
* add list
* pass the data in the x runned earlier
* append the data into the list
* add list in dictionary
* print dictionary in DataFrame

In [46]:
x = mycol.find()
x

In [47]:
mylist = []

In [48]:
for data in x:
    mylist.append(data)
    print(data)

{'_id': '001', 'name': 'WINNER E', 'product': 'LAPTOP', 'amount': 1, 'saleprice': 1500.0, 'status': 'SOLD', 'date': '2021-07-08'}
{'_id': '002', 'name': 'SHOE', 'product': 'SHOE', 'amount': 200, 'saleprice': 3000.0, 'status': 'sold', 'date': '2021-07-04'}
{'_id': '003', 'name': 'MERCY', 'product': 'SHOW', 'amount': 3, 'saleprice': 3000.0, 'status': 'SOLD', 'date': '2021-07-02'}
{'_id': '004', 'name': 'KATE', 'product': 'BAG', 'amount': 3000, 'saleprice': 100000.0, 'status': 'SOLD', 'date': '2021-07-01'}
{'_id': '005', 'name': 'LILIAN', 'product': 'HAIR', 'amount': 1500, 'saleprice': 150000.0, 'status': 'SOLD', 'date': '2021-07-09'}
{'_id': '006', 'name': 'MARY', 'product': 'HYPE', 'amount': 20000000, 'saleprice': 500000000.0, 'status': 'SOLD', 'date': '2021-07-03'}

In [49]:
print(mylist)

[{'_id': '001', 'name': 'WINNER E', 'product': 'LAPTOP', 'amount': 1, 'saleprice': 1500.0, 'status': 'SOLD', 'date': '2021-07-08'}, {'_id': '002', 'name': 'SHOE', 'product': 'SHOE', 'amount': 200, 'saleprice': 3000.0, 'status': 'sold', 'date': '2021-07-04'}, {'_id': '003', 'name': 'MERCY', 'product': 'SHOW', 'amount': 3, 'saleprice': 3000.0, 'status': 'SOLD', 'date': '2021-07-02'}, {'_id': '004', 'name': 'KATE', 'product': 'BAG', 'amount': 3000, 'saleprice': 100000.0, 'status': 'SOLD', 'date': '2021-07-01'}, {'_id': '005', 'name': 'LILIAN', 'product': 'HAIR', 'amount': 1500, 'saleprice': 150000.0, 'status': 'SOLD', 'date': '2021-07-09'}, {'_id': '006', 'name': 'MARY', 'product': 'HYPE', 'amount': 20000000, 'saleprice': 500000000.0, 'status': 'SOLD', 'date': '2021-07-03'}]

In [50]:
mongoDB_df = pd.DataFrame(mylist)
mongoDB_df

   _id      name product    amount    saleprice status        date
0  001  WINNER E  LAPTOP         1       1500.0   SOLD  2021-07-08
1  002      SHOE    SHOE       200       3000.0   sold  2021-07-04
2  003     MERCY    SHOW         3       3000.0   SOLD  2021-07-02
3  004      KATE     BAG      3000     100000.0   SOLD  2021-07-01
4  005    LILIAN    HAIR      1500     150000.0   SOLD  2021-07-09
5  006      MARY    HYPE  20000000  500000000.0   SOLD  2021-07-03

###### create a new column called total that multiplies the amount and the sales price

In [51]:
mongoDB_df['total'] = mongoDB_df['amount'] * mongoDB_df['saleprice']
mongoDB_df

,_id,name,product,amount,saleprice,status,date,total
0,001,WINNER E,LAPTOP,1,1500.0,SOLD,2021-07-08,1.500000e+03
1,002,SHOE,SHOE,200,3000.0,sold,2021-07-04,6.000000e+05
2,003,MERCY,SHOW,3,3000.0,SOLD,2021-07-02,9.000000e+03
3,004,KATE,BAG,3000,100000.0,SOLD,2021-07-01,3.000000e+08
4,005,LILIAN,HAIR,1500,150000.0,SOLD,2021-07-09,2.250000e+08
5,006,MARY,HYPE,20000000,500000000.0,SOLD,2021-07-03,1.000000e+16

# Pull data Together
###### pull all the dataframes created
* The sql daraframe
* the sqllite3 dataframe
* the mongodb dataframe

In [52]:
mysql_df

   id      name status  salary department position        data
0   1  Winner E    Yes    5000         IT       MG  2021-07-08
1   2   GRACE I    YES    4500         IT       HR  2021-07-06
2   3  LILIAN U    YES    6000         HR       MG  2021-07-08
3   4    KATE J     NO    3000         HR       IT  2021-07-05
4   5    JOHN E    YES    1000         HR       IT  2021-07-03

In [53]:
sqlite3_df

   id      name status  salary department position        data
0   1  Winner E    Yes   500.0         HR       MG  2021-07-08
1   2    MARY A     NO   700.0         IT       HR  2021-07-08
2   3       JOY    YES  1500.0         IT       IT  2021-07-09
3   4      KATE     NO  3000.0         HR       IT  2021-07-05
4   5     MERCY    YES  2000.0         HR       IT  2021-07-03

In [54]:
mongoDB_df

,_id,name,product,amount,saleprice,status,date,total
0,001,WINNER E,LAPTOP,1,1500.0,SOLD,2021-07-08,1.500000e+03
1,002,SHOE,SHOE,200,3000.0,sold,2021-07-04,6.000000e+05
2,003,MERCY,SHOW,3,3000.0,SOLD,2021-07-02,9.000000e+03
3,004,KATE,BAG,3000,100000.0,SOLD,2021-07-01,3.000000e+08
4,005,LILIAN,HAIR,1500,150000.0,SOLD,2021-07-09,2.250000e+08
5,006,MARY,HYPE,20000000,500000000.0,SOLD,2021-07-03,1.000000e+16

# Create a Data Warehouse (Using MySQL)

* N.B. MySQL is ran by xampp and MyPhp in browser -- localhost

###### Connect to MySQL Server

In [55]:
mydb = mysql.connector.connect(host="localhost",user="root",password="")

###### Create a Cursor object for ex

In [56]:
cursor = mydb.cursor()

###### Create Database warehouse in MySQL

In [57]:
cursor.execute("CREATE DATABASE datawarehouse")

###### Connect to MySQL Server Datawarehouse

In [58]:
mydb = mysql.connector.connect(host="localhost",user="root",password="",database='datawarehouse')

###### Create a Cursor object for Datawarehouse

In [59]:
cursor = mydb.cursor()

# Load Functions for MySQL

* table_name from created tables in each database
* load created dataframe into dictionary
* insert each table entity into the sql
* load data from each table entity counter

In [60]:
def create_table(table_name):
    cursor.execute(f"CREATE TABLE {table_name} (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), status VARCHAR(255), salary INT, department VARCHAR(255), position VARCHAR(255), high_date VARCHAR(255))")
    mydb.commit()

In [61]:
def convert_dataframe(dataframe):
    data_dict = dataframe.to_dict()
    return data_dict

In [62]:
def insert_query(table):
    sql = f"INSERT INTO {table}(name,status,salary,department,position,high_date) VALUES(%s,%s,%s,%s,%s,%s)"
    return sql

In [63]:
def load(data_dict,sql):
    counter = len(data_dict["name"].values())-1

    while counter >= 0:
        global name
        name = data_dict['name'][counter]
        global status
        status = data_dict['status'][counter]
        global salary
        salary = data_dict['salary'][counter]
        global department
        department = data_dict['department'][counter]
        global position
        position = data_dict['position'][counter]
        global date
        date = data_dict['data'][counter]
        vals = (name,status,salary,department,position,date)
        cursor.execute(sql,vals)
        mydb.commit()

        counter -= 1
        if counter == 0:
            print("All data has been inserted!!!")

# Load Function for MongoDB

* table_name from created tables in each database
* insert each table entity into the sql
* load data from each table entity counter

In [64]:
def create_table_mdb(table_name):
    cursor.execute(f"CREATE TABLE {table_name} (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), product VARCHAR(255), amount INT, saleprice INT, status VARCHAR(255), date VARCHAR(255), total VARCHAR(255))")
    mydb.commit()

In [65]:
def insert_query_mdb(table):
    sql = f"INSERT INTO {table}(name,product,amount,saleprice,status,date,total) VALUES(%s,%s,%s,%s,%s,%s,%s)"
    return sql

In [66]:
def load_mdb(data_dict,sql):
    counter = len(data_dict["name"].values())-1

    while counter >= 0:
        global name
        name = data_dict['name'][counter]
        global product
        product = data_dict['product'][counter]
        global amount
        amount = data_dict['amount'][counter]
        global saleprice
        saleprice = data_dict['saleprice'][counter]
        global status
        status = data_dict['status'][counter]
        global date
        date = data_dict['date'][counter]
        global total
        total = data_dict['total'][counter]
        vals = (name,product,amount,saleprice,status,date,total)
        cursor.execute(sql,vals)
        mydb.commit()

        counter -= 1
        if counter == 0:
            print("All data has been inserted!!!")

###### At this point each table for each database has been created in the Datawarehouse. Next step is to store all the datasource of each database into it's own placeholder

# MySQL Table in Datawarehouse to store MySQL data source

* create table
* passed saved dataframe into a database dictionary
* load dictionary and table

In [67]:
create_table("IT")

In [68]:
mysql_dict = convert_dataframe(mysql_df)
mysql_dict.pop('id')
mysql_dict

{'name': {0: 'Winner E',
  1: 'GRACE I',
  2: 'LILIAN U',
  3: 'KATE J',
  4: 'JOHN E'},
 'status': {0: 'Yes', 1: 'YES', 2: 'YES', 3: 'NO', 4: 'YES'},
 'salary': {0: 5000, 1: 4500, 2: 6000, 3: 3000, 4: 1000},
 'department': {0: 'IT', 1: 'IT', 2: 'HR', 3: 'HR', 4: 'HR'},
 'position': {0: 'MG', 1: 'HR', 2: 'MG', 3: 'IT', 4: 'IT'},
 'data': {0: '2021-07-08',
  1: '2021-07-06',
  2: '2021-07-08',
  3: '2021-07-05',
  4: '2021-07-03'}}

In [69]:
sql = insert_query("IT")
load(mysql_dict,sql)

All data has been inserted!!!

# SQLITE3 Table in Datawarehouse to store SQLite3 data source

* create table
* passed saved dataframe into a database dictionary
* load dictionary and table

In [70]:
create_table("HR")

In [71]:
sqlite3_dict = convert_dataframe(sqlite3_df)
sqlite3_dict.pop("id")
sqlite3_dict

{'name': {0: 'Winner E', 1: 'MARY A', 2: 'JOY', 3: 'KATE', 4: 'MERCY'},
 'status': {0: 'Yes', 1: 'NO', 2: 'YES', 3: 'NO', 4: 'YES'},
 'salary': {0: 500.0, 1: 700.0, 2: 1500.0, 3: 3000.0, 4: 2000.0},
 'department': {0: 'HR', 1: 'IT', 2: 'IT', 3: 'HR', 4: 'HR'},
 'position': {0: 'MG', 1: 'HR', 2: 'IT', 3: 'IT', 4: 'IT'},
 'data': {0: '2021-07-08',
  1: '2021-07-08',
  2: '2021-07-09',
  3: '2021-07-05',
  4: '2021-07-03'}}

In [72]:
sql = insert_query("HR")
load(sqlite3_dict,sql)

All data has been inserted!!!

# MongoDB Table in Datawarehouse to store MongoDB data source

* create table
* passed saved dataframe into a database dictionary
* load dictionary and table

In [73]:
create_table_mdb("transactions")

In [74]:
mongodb_dict = convert_dataframe(mongoDB_df)
mongodb_dict.pop("_id")
mongodb_dict

{'name': {0: 'WINNER E',
  1: 'SHOE',
  2: 'MERCY',
  3: 'KATE',
  4: 'LILIAN',
  5: 'MARY'},
 'product': {0: 'LAPTOP',
  1: 'SHOE',
  2: 'SHOW',
  3: 'BAG',
  4: 'HAIR',
  5: 'HYPE'},
 'amount': {0: 1, 1: 200, 2: 3, 3: 3000, 4: 1500, 5: 20000000},
 'saleprice': {0: 1500.0,
  1: 3000.0,
  2: 3000.0,
  3: 100000.0,
  4: 150000.0,
  5: 500000000.0},
 'status': {0: 'SOLD', 1: 'sold', 2: 'SOLD', 3: 'SOLD', 4: 'SOLD', 5: 'SOLD'},
 'date': {0: '2021-07-08',
  1: '2021-07-04',
  2: '2021-07-02',
  3: '2021-07-01',
  4: '2021-07-09',
  5: '2021-07-03'},
 'total': {0: 1500.0,
  1: 600000.0,
  2: 9000.0,
  3: 300000000.0,
  4: 225000000.0,
  5: 1e+16}}

In [75]:
sql = insert_query_mdb("transactions")
load_mdb(mongodb_dict,sql)

All data has been inserted!!!

##### By now, all tables with data's will have been stored in the datawarehouse.
* Go to localhost on browser,
* click on MyPhp 
* click on the newly created datawarehouse or whatever name you saved your combined database
* each individual table and it's contect will have been formed
* you can then click on each table to view it's content